## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_santa_rule.teamid-agilebits will be created
  + resource "zentral_santa_rule" "teamid-agilebits" {
      + configuration_id        = 1
      + custom_message          = "No 1Password 4 u"
      + description             = "Block AgileBits Software, mostly for demo purposes"
      + excluded_primary_users  = []
      + excluded_serial_numbers = []
      + excluded_tag_ids        = []
      + id                      = (known after apply)
      + policy                  = "BLOCKLIST"
      + primary_users           = []
      + ruleset_id              = (known after apply)
      + serial_numbers          = []
      + tag_ids                 = []
      + target_identifier       = "2BUAC4S2C"
      + target_type             = "TEAMID"
      + version                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>